* taobaoworks roadmap

** DONE huijun  meeting 确定做gemstone 部署的wbs分解
  CLOCK: [2011-09-21 Wed 12:03]--[2011-09-21 Wed 13:00] =>  0:57
[2011-09-21 Wed 12:03]
[[file:~/org/taobaoworks.org::*]]

  1. opsfree / rolesdb
  2. rt/k2
  3. broom
  4. oob
  5. account
  6. dns
  7. yum
  8. gemstone
 
** SA main road map						       :NOTE:
   CLOCK: [2011-09-21 Wed 14:26]--[2011-09-21 Wed 14:48] =>  0:22
[2011-09-21 Wed 14:26]

*** 预期分布

*** 系统的组成部分.
**** opsfree 
**** rt/k2
**** broom
**** oob
**** account
**** dns
**** yum
**** gemstone/cmos


*** 系统管理项目实施模板

**** 确定机器范围(TAGS)

**** 确定关联软件，以及工具.
***** 功能描述
      
**** 确定关联软件的配置管理方法.
***** 配置形式(net/localfile/none)
     
**** 部署方法描述.
**** 是否有相关的监控和自修复需求.

** 离职: zhangchengwei.pt@ 淘宝旅行， java 开发			       :NOTE:
   :LOGBOOK:
   CLOCK: [2011-09-30 Fri 14:08]--[2011-09-30 Fri 14:15] =>  0:07
   :END:
[2011-09-30 Fri 14:08]
** 离职 yuhao  03643  量子统计					       :NOTE:
   :LOGBOOK:
   CLOCK: [2011-09-30 Fri 14:20]--[2011-09-30 五 14:39] =>  0:19
   :END:
[2011-09-30 Fri 14:20]
[[file:~/org/refile.org::*][:NOTE:]]

** DONE 帮lidun 搞定 postgresql hstore
  :LOGBOOK:
  CLOCK: [2011-10-09 Sun 15:01]--[2011-10-09 Sun 15:04] =>  0:03
  CLOCK: [2011-10-09 Sun 11:41]--[2011-10-09 Sun 12:10] =>  0:29
  :END:
[2011-10-09 Sun 11:41]
[[file:~/org/refile.org::*%E5%9B%9E%E8%B4%AD][回购]]

 机器地址:

ssh yuting@shterm.aliyun-inc.com

李敦 2011-10-09 11:41:33
ay10-c，进去后到workgw这台机器
李敦 2011-10-09 11:41:40
ssh workgw

 postgresql 9.1 开始使用 create extention hstore 来创建 扩展


* wangwang
  rolesdb 加入到 opsfree 当中.
	- 需要确认加什么东西.

* aliyun 的云梯的入口
  1. ssh shterm.aliyun-inc.com
